{"speakers": [{"name": "Sergio Bastos", "avatar": "https://secure.gravatar.com/avatar/5772c55165da8496ae8e4a64210b69dc?s=500", "id": "5772c55165da8496ae8e4a64210b69dc", "country": "BR", "bio": "I am a mechanical engineer that likes to code since the 80's. I have made a study for an electric car sharing system for the city of Curitiba and it was based on a Python simulator that I have developed.", "organization": "Autonomous"}, {"name": "João Sebastião de Oliveira Bueno", "avatar": "https://secure.gravatar.com/avatar/ef459127edc89cc575d80a73cd8c567a?s=500", "id": "ef459127edc89cc575d80a73cd8c567a", "country": "BR", "bio": "João S. O. Bueno é desenvolvedor Python há mais de 15 anos, e sempre se interessou pela criação de imagens computacionais, usando diversos aplicativos e bibliotecas. É colaborador do GNU Image Manipulation Program (GIMP) desde 2004. Profissionalmente desenvolve aplicações Python backend em empresas de tecnologia. Já palestrou em dezenas de eventos de informática, com temas que vão do aprendizado de programação para iniciantes, até tópicos avançados com Python, alternando-os com temas de edição e tratamento de imagens e criação de plug-ins para o GIMP.", "organization": "OLIST"}, {"name": "Ariel Rossanigo", "avatar": "https://secure.gravatar.com/avatar/4c779175d6e0923f699f3c9c7d9f31bb?s=500", "id": "4c779175d6e0923f699f3c9c7d9f31bb", "country": "AR", "bio": "I'm Computer engineer since 2006 and I like everything related to Artificial Inteligence, Machine Learning and DataScience. I teach Artificial Inteligence (among other subjects) since 2006. I'm a member of PyAr since 2005, and from that time I use Python to teach and work. I'm from Rafaela, Santa Fe, Argentina.", "organization": "UCSE"}, {"name": "Eduardo Sánchez", "avatar": "https://secure.gravatar.com/avatar/d8066319536a62941c5e186cc9984c15?s=500", "id": "d8066319536a62941c5e186cc9984c15", "country": "CU", "bio": "Eduardo Sánchez is the head of Havana Blockchain Center, an non-profit that educates developers, researchers, government officials and communities on the impact of DLT in Cuban society. Mr. Sánchez presented last year at the Latin American Bitcoin & Blockchain Conferences and at the One Young World Summit. He has worked at blockchain companies like Skycoin, and currently gives technical & non-technical workshops on DLT to developers around Cuba. Mr. Sánchez has a B.S. in Computer Science, defending the first Diploma Thesis on blockchain technologies at the University of Havana. He is a Young Leaders of the Americas Initiative (YLAI) Fellow and a One Young World Ambassador.", "organization": "Havana Blockchain Center"}, {"name": "LucianoFromTrelew", "avatar": "https://secure.gravatar.com/avatar/23f911d108e5472c6346c7b4f4faa42c?s=500", "id": "23f911d108e5472c6346c7b4f4faa42c", "country": "BR", "bio": "Computer Science student from Trelew, Chubut, Argentina. Linux and Python enthusiast. I also like frontend development :D Indian Pale Ale FTW!", "organization": ""}, {"name": "Arthur Fortes da Costa", "avatar": "https://secure.gravatar.com/avatar/85074fea74776f6f7dbc40b97fbe6311?s=500", "id": "85074fea74776f6f7dbc40b97fbe6311", "country": "BR", "bio": "PhD candidate at the Institute of Mathematical and Computational Sciences, University of São Paulo. Graduated in Computer Science from the Faculty CEUT and master's degree in Computer Science from the University of São Paulo (2015). I am also member of Grupy of São Carlos (Grupy-Sanca). My research interests include Recommender Systems, Data Science, Web Development and Customization and adaptation of content.", "organization": "University of São Paulo"}, {"name": "Abel Siqueira", "avatar": "../../assets/img/avatar/abelsiqueira.jpg", "id": "abelsiqueira.jpg", "country": "BR", "bio": "I'm a professor at the Federal University of Paraná (UFPR), working with nonlinear optimization. My main focus is the development of optimization solvers and tools in the Julia Language, as part of the JuliaSmoothOptimizers organization.", "organization": "UFPR"}, {"name": "Carlos Cordoba", "avatar": "../../assets/img/avatar/carlos_cordoba.jpg", "id": "carlos_cordoba.jpg", "country": "CO", "bio": "Spyder developer, Python enthusiast, long time Mathematica user.", "organization": "Anaconda"}, {"name": "Juan Funez", "avatar": "https://pbs.twimg.com/profile_images/982813168161435648/1LbYFFK3_400x400.jpg", "id": "1LbYFFK3_400x400.jpg", "country": "BR", "bio": "Python developer from Uruguay, working at SciELO as a Software Analyst since 2014 and with almost a decade of experience Python. Open science enthusiast and science communications supporter.", "organization": "Scielo"}, {"name": "Leticia Portella", "avatar": "../../assets/img/avatar/leticia_portella.jpg", "id": "leticia_portella.jpg", "country": "BR", "bio": "Com formação e mestrado em uma área pouco convencional, Oceanografia, tornou-se desenvolvedora e cientista de dados. Trabalhou especialmente com dados espaciais e temporais e sistemas de informação geográfica durante sua formação e trabalha atualmente com desenvolvimento backend e aprendizado de máquina. É uma das fundadoras do Pizza de Dados, um podcast brasileiro de ciência de dados, é mentora do Data Bootcamp Floripa e trabalha com a Open Knowledge Foundation Brasil e a Operação Serenata de Amor usando tecnologia em projetos de inovação Cívica.", "organization": "Open Knowledge Foundation Brasil"}, {"name": "Melissa Weber Mendonça", "avatar": "../../assets/img/avatar/melissa_w_mendonca.jpg", "id": "melissa_w_mendonca.jpg", "country": "BR", "bio": "Professor at the Mathematics Department of Universidade Federal de Santa Catarina (UFSC). LaTeX, Python and free software evangelist.", "organization": "UFSC"}, {"name": "Lucas Kotres", "avatar": "../../assets/img/avatar/lucas_kotres.jpg", "id": "lucas_kotres.jpg", "country": "", "bio": "Analista na Elipse Software, com mais de 12 anos de experiência em desenvolvimento de software.", "organization": ""}], "activities": [{"state": "accepted", "confirmed": "0", "email": "hdbastos@gmail.com", "organization": "Autonomous", "title": "Simulating a electric car sharing operation with Python", "abstract": "How to write an electric car sharing simulation using Python and Simpy. The talk is basically to describe this article: https://www.linkedin.com/pulse/simulating-electric-car-sharing-operation-sergio-bastos/", "location": "BR", "shirt_size": "Men's XL", "twitter": "", "tags": "[\"Python\", \"Simpy\", \"Carsharing\", \"Sharing\"]", "talk_format": "Talk (~30-45 minutes)", "bio": "I am a mechanical engineer that likes to code since the 80's. I have made a study for an electric car sharing system for the city of Curitiba and it was based on a Python simulator that I have developed.", "status": "Confirmada", "avatar": "https://secure.gravatar.com/avatar/5772c55165da8496ae8e4a64210b69dc?s=500", "rating": "0", "created_at": "July 06, 2018 12:06 UTC", "notes": "I am a mechanical engineer that likes to code since the 80's. I have made a study for an electric car sharing system for the city of Curitiba and it was based on a Python simulator that I have developed.", "additional_info": "papercall.io", "description": "How to write an electric car sharing simulation using Python and Simpy", "url": "", "name": "Sergio Bastos", "audience_level": "All"}, {"state": "accepted", "confirmed": "0", "email": "gwidion@gmail.com", "organization": "OLIST", "title": "Plotando dados do zero: Customizando seus resultados com Python", "abstract": "Como usar Python para gerar plotagens e infográficos sem usar as bibliotecas de plotagem tradicionais. Entender o passo a passo da criação de um plot, usando bibliotecas básicas, ou criar a saída para uma visualização em 3D ou animação pode mudar a percepção dos seus resultados para vários públicos.", "location": "BR", "shirt_size": "Men's L", "twitter": "gwidion", "tags": "[\"python\", \"science\", \"data-visualization\"]", "talk_format": "Talk (~30-45 minutes)", "bio": "João S. O. Bueno é desenvolvedor Python há mais de 15 anos, e sempre se interessou pela criação de imagens computacionais, usando diversos aplicativos e bibliotecas. É colaborador do GNU Image Manipulation Program (GIMP) desde 2004. Profissionalmente desenvolve aplicações Python backend em empresas de tecnologia. Já palestrou em dezenas de eventos de informática, com temas que vão do aprendizado de programação para iniciantes, até tópicos avançados com Python, alternando-os com temas de edição e tratamento de imagens e criação de plug-ins para o GIMP.", "status": "Confirmada", "avatar": "https://secure.gravatar.com/avatar/ef459127edc89cc575d80a73cd8c567a?s=500", "rating": "0", "created_at": "July 28, 2018 06:20 UTC", "notes": "Esta palestra pode ser bastante útil tanto para pesquisadores querendo mostrar seus resultados para um público diferente do público acadêmico, como para perceber a possibilidade de plotar resultados em tipos de gráficos ainda não existentes nas bibliotecas existentes. Também é interessante para estudantes e professores perceberem que ao escreverem suas próprias rotinas para um criação de um plot, se dá um entendimento muito melhor de quais realmente são as grandezas envolvidas, e do significado dos dados do que escrever `plt.plot(...)` e ver um resultado padronizado, mas com pouco significado. O palestrante é desenvolvedor Python há mais de 15 anos, e tem grande interesse nas áreas de criação de imagens e bibliotecas gráficas.", "additional_info": "papercall.io", "description": "Plotagem Customizada ===================== As vezes precisamos de uma plotagem de dados mais impactante. Dependendo do público alvo, ou mesmo para uma melhor visualização dos resultados, gráficos com cores variadas, plotagens em um campo 3D usando texturas, iluminação e transparência, podem fazer toda a diferença em comunicar os resultados de uma pesquisa. Os vários pacotes científicos do Python são integrados com bibliotecas para plotagem de dados acadêmicas consagradas e padronizadas. No entanto, nem sempre a saída obtida por essas bibliotecas padrão, como a matplotlib, ggplot e seus derivados tem um resultado final agradável. Embora quase sempre tenham o resultado mais acurado, geram uma saida visualmente estéril dos dados, mais preocupada em exatidão das medidas e label-ticks:os interessados nessas medidas podem bem visualizar os dados diretamente na forma numérica - a principal intenção de plotagem de gráficos é justamente tornar os resultados mais atraentes. Python é uma linguagem de programação completa, que integra e manipula dados em mais domínios do que estamos acostumados. Nesta apresentação, teremos uma demonstração de como criar alguns tipos de gráficos a partir do zero, em várias bibliotecas que disponibilizam apenas uma API 2D simples, o que nos permite customizar cores e formas. Exemplos de bibliotecas que podem ser usadas são a Pygame, tkinter e pillow. É possível também usar mecanismos de template de texto do Python para gerar saídas de gráficos diferenciados em 2D, gerando diretamente código Postscript e 3D com texturas foto-realistas, transparências e sombras gerando arquivos para o renderizador Povray. Dentre outras possibilidades, esses mecanismos também permitem a criação de gráficos animados, permitindoa incorporação de uma dimensão a mais aos dados, ou comparando séries diferentes elaborando-se alguma forma de transição entre as mesmas. Espera-se que o público entenda a ideia de que a visualização de seus resultados não está limitada aos temas padronizados que acompanham as bibliotecas de postagem, e que sempre é possível apresentar os gráficos de forma bastante estética e chamativa, usando toda a flexibilidade que o Python proporciona.", "url": "https://stackoverflow.com/users/108205/jsbueno", "name": "João Sebastião de Oliveira Bueno", "audience_level": "All"}, {"state": "accepted", "confirmed": "0", "email": "arielrossanigo@gmail.com", "organization": "UCSE", "title": "My scientific python toolbox", "abstract": "When starting a new project, it's fundamental to use the right tools. The aim of this talk is to show some of the main characteristics of the tools that I use in projects related to data and machine learning.", "location": "AR", "shirt_size": "Men's L", "twitter": "arielrossanigo", "tags": "[\"python\", \"science\"]", "talk_format": "Talk (~30-45 minutes)", "bio": "I'm Computer engineer since 2006 and I like everything related to Artificial Inteligence, Machine Learning and DataScience. I teach Artificial Inteligence (among other subjects) since 2006. I'm a member of PyAr since 2005, and from that time I use Python to teach and work. I'm from Rafaela, Santa Fe, Argentina.", "status": "Confirmada", "avatar": "https://secure.gravatar.com/avatar/4c779175d6e0923f699f3c9c7d9f31bb?s=500", "rating": "0", "created_at": "July 28, 2018 21:59 UTC", "notes": "I've been working in data science and machine learning projects for more than 4 years and several times people asked about how to start, what tools they need to learn. The aim of this talk is to be the answer to that questions, like an introduction to Python and Data related projects. I'm able to perform the talk in Spanish or English.", "additional_info": "papercall.io", "description": "When starting a new project, it's fundamental to use the right tools. The aim of this talk is to show some of the main characteristics of the tools that I use in projects related to data and machine learning. The main subjects we will cover in the talk are: programming environment, data processing, visualizations and Machine Learning.", "url": "https://github.com/arielrossanigo", "name": "Ariel Rossanigo", "audience_level": "Beginner"}, {"state": "accepted", "confirmed": "0", "email": "eduardosanchezg37@gmail.com", "organization": "Havana Blockchain Center", "title": "Let's build a blockchain! Coding a mini-cryptocurrency in Python", "abstract": "The topic of blockchain and DLT has exploded over the past 18 months, with a market cap of almost $300bn as of July 2018. We will learn how to build a cryptocurrency from scratch, analyzing the components that power a blockchain, and the advantages of a decentralized, crypto-secured structure.", "location": "CU", "shirt_size": "Men's S", "twitter": "Eduardo_SG_", "tags": "[\"Emerging Computing Technologies\"]", "talk_format": "Workshop (> 60 minutes)", "bio": "Eduardo Sánchez is the head of Havana Blockchain Center, an non-profit that educates developers, researchers, government officials and communities on the impact of DLT in Cuban society. Mr. Sánchez presented last year at the Latin American Bitcoin & Blockchain Conferences and at the One Young World Summit. He has worked at blockchain companies like Skycoin, and currently gives technical & non-technical workshops on DLT to developers around Cuba. Mr. Sánchez has a B.S. in Computer Science, defending the first Diploma Thesis on blockchain technologies at the University of Havana. He is a Young Leaders of the Americas Initiative (YLAI) Fellow and a One Young World Ambassador.", "status": "Confirmada", "avatar": "https://secure.gravatar.com/avatar/d8066319536a62941c5e186cc9984c15?s=500", "rating": "0", "created_at": "July 21, 2018 19:00 UTC", "notes": "Basic knowledge of Python programming is required for a full understanding of the workshop. Participants should have access to a computer with a copy of a Python 3 installation and connection to a shared network. This workshop in partially inspired by Haseeb Qureshi's \"A mini-crytocurrency in Ruby\".", "additional_info": "papercall.io", "description": "In this workshop, we will begin by asking ourselves the reasons to build a digital currency. We'll review the postulates of the cypherpunks and their motives to develop a currency for the internet, with a focus on privacy and security. Then we'll try to build a digital currency in the most intuitive way. We'll start out by coding a naïve, centralized, PayPal-like digital currency. The shortcomings of this approach will be exposed: it's serious risks regarding reliability and security. We'll conclude this weaknesses emerge from it's centralized nature, and we'll try to rethink our digital currency to avoid a single point of failure. Subsecuently, we'll review decentralized protocols, moving from a server/client structure to a gossip protocol. As we test it out, we'll notice that, even when we have achieved fault-tolerance, we still lack Byzantine-fault tolerance (BFT). To establish an effective method of authentication, we'll introduce the concept of cryptographic identities, and learn the basics of public-key cryptography for asserting a message's authenticity. After integrating asymmetric encryption into our gossip protocol, we'll notice we still suffer the double-spend problem. We'll review a few approaches to solving the double-spend problem, most of them using centralized architectures, taking us to the first shortcomings we explored. At this point, we'll realize the main issue with decentralized protocols is that often, peers can't agree on the timing of certain events. We'll conclude we'll need to implement a decentralized timestamping server, and here we'll introduce the blockchain as a data structure that provides a notion of order among its blocks, while making it very hard to change that order thanks to the Proof-of-Work consensus mechanism. During the implementation of the blockchain, we'll look at the elements that form it, such as the notion of mining and the fork resolution methods (longest chain rule). As the workshop has a limited timespan, we'll have to skip a few topics, such as the economics of cryptocurrencies, the concept of merkle trees, SPVs, as well as smart contracts and other DLT like hashgraph or tangle. Nevertheless, at the end of the workshop, the audience will have a basic understanding of the work of blockchain technologies, which are becoming mainstream in the coordination of human activity, and a key player in current and future approaches to emerging technologies such as distributed computing and AI (paramount tools for computer scientists in the 21st century).", "url": "https://linkedin.com/in/eduardosg", "name": "Eduardo Sánchez", "audience_level": "All"}, {"state": "accepted", "confirmed": "0", "email": "arielrossanigo@gmail.com", "organization": "UCSE", "title": "Image processing with deep learning", "abstract": "This talk is an introduction to deep learning and the kind of layers and networks used to perform image processing. During the talk a complete classification example will be done using Keras.", "location": "AR", "shirt_size": "Men's L", "twitter": "arielrossanigo", "tags": "[\"Python\", \"Image processing\", \"Keras\", \"Deep Learning\", \"Neuronal networks\"]", "talk_format": "Talk (~30-45 minutes)", "bio": "I'm Computer engineer since 2006 and I like everything related to Artificial Inteligence, Machine Learning and DataScience. I teach Artificial Inteligence (among other subjects) since 2006. I'm a member of PyAr since 2005, and from that time I use Python to teach and work. I'm from Rafaela, Santa Fe, Argentina.", "status": "Confirmada", "avatar": "https://secure.gravatar.com/avatar/4c779175d6e0923f699f3c9c7d9f31bb?s=500", "rating": "0", "created_at": "July 28, 2018 22:27 UTC", "notes": "", "additional_info": "papercall.io", "description": "This talk is an introduction to deep learning and the kind of layers and networks used to perform image processing. During the talk a complete clasification example will be done using Keras. Agenda: * Machine Learning, * Neuronal Networks, Deep Learning * Convolution layers * MaxPooling, DropOut, DenseLayers * Classification example * Filter visualization", "url": "https://github.com/arielrossanigo", "name": "Ariel Rossanigo", "audience_level": "Intermediate"}, {"state": "accepted", "confirmed": "0", "email": "lucianoserruya@gmail.com", "organization": "", "title": "Datawarehousing para datos genéticos, socioeconómicos y fenotípicos, con visualización 3D", "abstract": "Se presenta una aplicación para el almacenamiento, análisis, y visualización interactiva de datos heterogéneos pertenecientes al biobanco de la Patagonia (proyecto RAICES), basado en herramientas libres como Django Rest Framework, Vue.js, Bokeh, THREE.js, y contenedores de Docker", "location": "BR", "shirt_size": "Men's XL", "twitter": "LucianoSerruya", "tags": "[\"python\", \"datascience\", \"biology\", \"Bioinformatics\", \"javascript\", \"vue\", \"threejs\", \"django\", \"drf\", \"pandas\", \"bokeh\", \"visualization\", \"3d\", \"docker\", \"mongo\"]", "talk_format": "Talk (~30-45 minutes)", "bio": "Computer Science student from Trelew, Chubut, Argentina. Linux and Python enthusiast. I also like frontend development :D Indian Pale Ale FTW!", "status": "Confirmada", "avatar": "https://secure.gravatar.com/avatar/23f911d108e5472c6346c7b4f4faa42c?s=500", "rating": "0", "created_at": "July 20, 2018 23:17 UTC", "notes": "Somos dos estudiantes (Luciano Serruya Aloisi y Pablo Toledo Margalef) de la Licenciatura en Sistemas de la UNPSJB próximos a recibirnos (2019/2020), con gran interés en el desarrollo de software (en Python, principalmente) y en su aplicación en la ciencia y en la investigación. Este trabajo fue realizado a través de una pasantía promovida por el Laboratorio de Ciencias de las Imágenes (LCI) de la Universidad Nacional del Sur. Durante el 2017 y 2018, dimos las siguientes charlas en el [Patagonia Python Meetup](https://www.meetup.com/Patagonia-Python-Meetup/): - Septiembre de 2017: - [Análisis de datos con Pandas](https://papablo.github.io/slides/intropandas2017/) - [Patrones de Diseño en Python](https://github.com/LucianoFromTrelew/meetup-pd) - Marzo de 2018: - [Deploy de aplicaciones Python en Heroku](https://github.com/PaPablo/twitter-bot-hero) - [Cómo publicar Python en PIP](https://github.com/LucianoFromTrelew/cloneme)", "additional_info": "papercall.io", "description": "El Instituto Patagónico de Ciencias Sociales y Humanas de Ciencias Sociales y Humanas ([IPCSH-CONICET](http://www.ipcsh.conicet.gob.ar/)) estudia cómo se relacionan las costumbres y herencias de la región con variables físicas de interés médico, en particular con rasgos de riesgo para enfermedades complejas como obesidad, sobrepeso y síndrome metabólico, entre otras. El proyecto [RAICES](https://www.facebook.com/proyecto.raices.patagonia/) (iniciativa propia del IPCSH-CONICET) busca generar un banco de datos genéticos o biobanco de la Patagonia que pueda servir para futuras aplicaciones en el diseño de políticas públicas de salud. Este trabajo, realizado a través de una pasantía promovida por el Laboratorio de Ciencias de las Imágenes (LCI) de la Universidad Nacional del Sur, presenta la implementación de un datawarehouse (basado en Python y MongoDB) que permite a los investigadores del proyecto almacenar, consultar y analizar datos heterogéneos propios de la colecta (encuestas socioeconómicas, información geográfica y genética, hábitos alimenticios, modelos 3D, vídeos de cuerpo completo, medidas antropométricas, entre otros). Dado que las fuentes de datos eran diversas, se trabajó en un módulo de *ETL* (*Extract, Transform and Load*) para normalizar los datos y adaptarlos al modelo del datawarehouse. Junto con el datawarehouse se diseñó y desarrolló una [aplicación web](https://youtu.be/CIpbHRLAG0I) para la carga masiva de datos y acceso a los mismos en forma selectiva, brindando también una plataforma interactiva de visualización de datos exploratoria (gráficos y modelos 3D). Se tiene como resultado un framework fácilmente generalizable basado en tecnologías libres disponible para ser utilizado en otros ámbitos científicos Las tecnologías utilizadas para el desarrollo del trabajo fueron las siguientes: - [Django Rest Framework](http://www.django-rest-framework.org/) (desarrollo de una API REST) - [Vue.js](https://vuejs.org/) (cliente web) - [Bokeh](https://bokeh.pydata.org/en/latest/) (visualización de gráficos 2D) - [THREE.js](https://threejs.org/) (visualización 3D) - [Pandas](https://pandas.pydata.org/), [pyocr](https://gitlab.gnome.org/World/OpenPaperwork/pyocr), y [pillow](https://python-pillow.org/) (módulo de ETL) - [Mongoengine](http://mongoengine.org/) (comunicación con la base de datos) - [Docker](https://www.docker.com/) (puesta en producción de todo el sistema)", "url": "https://github.com/LucianoFromTrelew", "name": "LucianoFromTrelew", "audience_level": "All"}, {"state": "accepted", "confirmed": "0", "email": "fortes.arthur@gmail.com", "organization": "University of São Paulo", "title": "A Guide to Understand and Build a Recommender System Engine", "abstract": "This talk aims to present the main concepts and development of Recommender Systems elements for developers who wish to generate personalized content for users based on their interactions - an overview of the development. The talk will also introduce a Python recommender framework, called CaseRec.", "location": "BR", "shirt_size": "Men's L", "twitter": "fortesarthur", "tags": "[\"python\", \"science\", \"recommender systems\", \"data science\"]", "talk_format": "Talk (~30-45 minutes)", "bio": "PhD candidate at the Institute of Mathematical and Computational Sciences, University of São Paulo. Graduated in Computer Science from the Faculty CEUT and master's degree in Computer Science from the University of São Paulo (2015). I am also member of Grupy of São Carlos (Grupy-Sanca). My research interests include Recommender Systems, Data Science, Web Development and Customization and adaptation of content.", "status": "Confirmada", "avatar": "https://secure.gravatar.com/avatar/85074fea74776f6f7dbc40b97fbe6311?s=500", "rating": "0", "created_at": "June 20, 2018 14:14 UTC", "notes": "## Requirements ### Participants Due the focus of this tutorial is on presenting concepts and developing recommender approaches for participants with no previous experience, no prerequisite knowledge of programming languages or specific software is required. For the practical examples, the Python language and its scientific libraries will be used and explained: NumPy, SciPy, Sklearn e Pandas. ### Computational and audio-visual resources Regarding the computational and audio-visual resources required, it would be interesting, but not impeding, that each participant have access to a personal computer capable of executing and processing commands in Python [https://www.python.org], preferably using the Linux operating system. It would be more attractive for participants to be able to run the examples themselves that will be made available through GitHub [https://github.com/]. For presentation, only one projector and one projection screen will be required.", "additional_info": "papercall.io", "description": "## Context and Motivation From 2005 to 2020, the information in the digital universe will grow by a factor of 300, from 130 exabytes to 40,000 exabytes, or 40 trillion gigabytes (more than 5,200 gigabytes for every man, woman, and child in 2020) [1]. It is simply not possible to grasp even a small percentage of it in a single lifetime, there is too much information to process and to choose. The expression Information Overload was introduced to describe the sensation of fatigue and distress that follows the cognitive surplus required to handle the volume of information we have to deal with every day. Recommender Systems (RS) have emerged in response to the information overload problem by learning from users about their interests from past user actions (ratings, votes, ranked lists, mouse clicks, page views, product purchases, etc.) and suggesting products that are likely to fit their needs. Many e-commerce and social media companies are leveraging the power of data science and boosting sales by implementing Recommender Systems on their platforms. This approach aim to predict users’ interests and recommend products that quite likely are interesting for them. In this context, this talk aims to provide support for professionals and researchers to know fundamental concepts about recommender systems, as well as the use in practice of techniques of recommendation and evaluation of these systems in their research and applications, aiming at personalization and optimization of the user experience in their systems.. The talk will also serve to introduce a Python recommender framework, called CaseRec [2]. The framework implements the well-knows and state-of-the-art recommendation algorithms in rating prediction and item recommendation scenario, with several evaluation methodologies. ## Rationale of Interest and Audience Attraction The growing amount of information available on the web and the technological advancement with new e-business services and social networks have provided a content overload to users, providing the emergence of Recommender Systems. Currently, these systems play a key role in sites such as Americanas, Amazon, YouTube, Netflix, Spotify and Social Networks (Facebook, Twitter, Instagram and LinkedIn), in order to attract and loyalty users. In this context, this talk is intended for professionals and academics from research areas related to user experience who wish to use Recommender Systems in their research and applications, but find conceptual or practical difficulties in the development of their applications. The participants will gain insight on how to develop and evaluate the recommendation tools in practice. ## Topics * Recommender Systems Overview * Filtering Paradigms * Generating Users and Items Representations * Neighborhood and Matrix Factorization Models * Tools and Evaluation ## References [1] https://www.emc.com/leadership/digital-universe/2012iview/ [2] https://github.com/ArthurFortes/CaseRecommender/", "url": "https://arthurfortes.github.io/", "name": "Arthur Fortes da Costa", "audience_level": "All"}, {"state": "", "confirmed": "", "email": "abel.s.siqueira@gmail.com", "organization": "UFPR", "title": "Mathematical Optimization on the Julia Language", "abstract": "Julia is a high-performance language designed for numerical computing. In this presentation, we'll see a brief overview of some of the optimization packages available for Julia. I'll focus on packages from the JuliaSmoothOptimizers organization, which has useful packages for researchers on the field of continuous nonlinear optimization.", "location": "BR", "shirt_size": "Men's XXL", "twitter": "abel_siqueira", "tags": "", "talk_format": "Talk (~30-45 minutes)", "bio": "I'm a professor at the Federal University of Paraná (UFPR), working with nonlinear optimization. My main focus is the development of optimization solvers and tools in the Julia Language, as part of the JuliaSmoothOptimizers organization.", "status": "Confirmada", "avatar": "../../assets/img/avatar/abelsiqueira.jpg", "rating": "", "created_at": "", "notes": "", "additional_info": "convidada/convidado", "description": "", "url": "http://abelsiqueira.github.io", "name": "Abel Siqueira", "audience_level": ""}, {"state": "", "confirmed": "", "email": "ccordoba12@gmail.com", "organization": "Anaconda", "title": "Keynote", "abstract": "Keynote", "location": "CO", "shirt_size": "Solicitar", "twitter": "ccordoba12", "tags": "", "talk_format": "Keynote", "bio": "Spyder developer, Python enthusiast, long time Mathematica user.", "status": "Confirmada", "avatar": "../../assets/img/avatar/carlos_cordoba.jpg", "rating": "", "created_at": "", "notes": "", "additional_info": "convidada/convidado", "description": "keynote", "url": "https://github.com/ccordoba12", "name": "Carlos Cordoba", "audience_level": ""}, {"state": "", "confirmed": "", "email": "juan@funez.uy", "organization": "Scielo", "title": "Ciência: Como produzir? Sem recursos, sem saúde mental, sem apoio, e o que o acesso aberto tem a ver com isso? / Science: How to produce? No resources, no mental health, no support, and what does open access have to do with it?", "abstract": "In recent times science in Brazil has suffered cuts, lack of resources, scrapping and other factors make the environment to produce science is hostile. Without material, without support and without mental health to deal with all this, many scientists are forced to look for opportunities in other countries. Scientific Communication, discussions with society and peer cooperation, is seen as a means to reduce this gap between scientists and society. Open access to search results becomes mandatory to see further on the shoulders of giants.", "location": "BR", "shirt_size": "Men's L", "twitter": "juanfunez", "tags": "", "talk_format": "Keynote", "bio": "Python developer from Uruguay, working at SciELO as a Software Analyst since 2014 and with almost a decade of experience Python. Open science enthusiast and science communications supporter.", "status": "Confirmada", "avatar": "https://pbs.twimg.com/profile_images/982813168161435648/1LbYFFK3_400x400.jpg", "rating": "", "created_at": "", "notes": "", "additional_info": "convidada/convidado", "description": "In recent times science in Brazil has suffered cuts, lack of resources, scrapping and other factors make the environment to produce science is hostile. Without material, without support and without mental health to deal with all this, many scientists are forced to look for opportunities in other countries. Scientific Communication, discussions with society and peer cooperation, is seen as a means to reduce this gap between scientists and society. Open access to search results becomes mandatory to see further on the shoulders of giants.", "url": "http://funez.uy", "name": "Juan Funez", "audience_level": "All"}, {"state": "", "confirmed": "", "email": "leportella@gmail.com", "organization": "Open Knowledge Foundation Brasil", "title": "Operação Serenata de Amor", "abstract": "Vamos falar sobre como surgiu a ideia da Operação Serenata de Amor, métodos de trabalho do projeto, e quais foram as resultados do mesmo. Também falar sobre o que vem por ai nos novos projetos que estamos trabalhando!", "location": "BR", "shirt_size": "Female's M", "twitter": "leportella", "tags": "", "talk_format": "Keynote", "bio": "Com formação e mestrado em uma área pouco convencional, Oceanografia, tornou-se desenvolvedora e cientista de dados. Trabalhou especialmente com dados espaciais e temporais e sistemas de informação geográfica durante sua formação e trabalha atualmente com desenvolvimento backend e aprendizado de máquina. É uma das fundadoras do Pizza de Dados, um podcast brasileiro de ciência de dados, é mentora do Data Bootcamp Floripa e trabalha com a Open Knowledge Foundation Brasil e a Operação Serenata de Amor usando tecnologia em projetos de inovação Cívica.", "status": "Confirmada", "avatar": "../../assets/img/avatar/leticia_portella.jpg", "rating": "", "created_at": "", "notes": "", "additional_info": "convidada/convidado", "description": "Vamos falar sobre como surgiu a ideia da Operação Serenata de Amor, métodos de trabalho do projeto, e quais foram as resultados do mesmo. Também falar sobre o que vem por ai nos novos projetos que estamos trabalhando!", "url": "http://leportella.com/", "name": "Leticia Portella", "audience_level": ""}, {"state": "", "confirmed": "", "email": "melissawm@gmail.com", "organization": "UFSC", "title": "Scientific Computing with a Scientific Bias", "abstract": "Nowadays, when we talk about \"scientific computing\", people assume we are talking about data science. However, there is much more to scientific computing than the techniques involved in analytics or machine learning. In particular, mathematical concepts from linear algebra and numerical analysis are crucial for the development of good scientific code. In this talk, we will discuss mathematical and computational techniques that are being used today by scientists and research software engineers in order to solve complex scientific problems in physics, chemistry, engineering and other domains.", "location": "BR", "shirt_size": "Female's M", "twitter": "melissawm", "tags": "", "talk_format": "Keynote", "bio": "Professor at the Mathematics Department of Universidade Federal de Santa Catarina (UFSC). LaTeX, Python and free software evangelist.", "status": "Confirmada", "avatar": "../../assets/img/avatar/melissa_w_mendonca.jpg", "rating": "", "created_at": "", "notes": "", "additional_info": "convidada/convidado", "description": "Nowadays, when we talk about \"scientific computing\", people assume we are talking about data science. However, there is much more to scientific computing than the techniques involved in analytics or machine learning. In particular, mathematical concepts from linear algebra and numerical analysis are crucial for the development of good scientific code. In this talk, we will discuss mathematical and computational techniques that are being used today by scientists and research software engineers in order to solve complex scientific problems in physics, chemistry, engineering and other domains.", "url": "mtm.ufsc.br/~melissa", "name": "Melissa Weber Mendonça", "audience_level": "Beginner"}, {"state": "", "confirmed": "", "email": "fortes.arthur@gmail.com", "organization": "University of São Paulo", "title": "Case Recommender: Utilizando Python para desenvolver sistemas de recomendação", "abstract": "Que tal falar sobre recomendação?\n\nOs sistemas de recomendação são uma subárea de recuperação de informação (do inglês, Information Retrival) que tem por objetivo fazer novas sugestões personalizadas que possam vir a ser de interesse do usuário, com base nos seus feedback (sejam implícitos ou explícitos) ou nas escolhas feitas por outros usuários com gostos similares. Bons sistemas de recomendação podem aumentar as vendas/acessos em vários pontos percentuais. É por isso que eles se tornaram um recurso essencial para lojas e serviços online e têm sido uma área bastante procurada no mercado. Devido a esta necessidade de conquista, a personalização tem se apresentado como um fator facilitador no momento de \"cativar\" o usuário.\n\nAo navegar por sites como Amazon, Facebook e Americanas você já se deparou com frases como “Quem viu este produto, viu também…”, “Clientes que compraram este item também compraram…” e “Porque você comprou este produto…” ? Ou quem sabe, ao assistir um filme ou ouvir uma música no Netflix/Spotify, encontrou, dentre as sugestões, alguma outra produção que se encaixava direitinho com seu gosto? Este tutorial dará uma visão geral sobre os sistemas de recomendação utilizados nas tarefas de personalização, assim como ferramentas e bibliotecas que podem auxiliar os desenvolvedores a implementar esses sistemas em Python. Serão apresentadas diversas bases de dados públicas reais, scripts e algoritmos em Python, para gerar e avaliar a recomendação, além dos principais problemas que surgem durante a implementação de um recomendador. A fim de facilitar a aprendizagem e a compreensão do conceito, este tutorial irá se utilizar do framework Case Recommender: uma ferramenta implementada em Python, que possui uma série de populares algoritmos de recomendação, tanto para feedback implícito quanto explícito, em diferentes abordagens baseadas nos principais tipos de recomendação, sendo eles previsão de notas e ranking.\n\nSerão abordados, ainda, conceitos de Aprendizado de Máquina e Inteligência Artificial, como Cross Validation, KNN, SVD, métricas de similaridade, entre outros, utilizando as bibliotecas numpy, scipy e sklearn do Python. Assim, serão apresentados os principais conceitos e estratégias que os sistemas de recomendação utilizam para transformar dados em informação personalizada altamente poderosa. ", "location": "BR", "shirt_size": "Men's L", "twitter": "fortesarthur", "tags": "", "talk_format": "Workshop (> 60 minutes)", "bio": "PhD candidate at the Institute of Mathematical and Computational Sciences, University of São Paulo. Graduated in Computer Science from the Faculty CEUT and master's degree in Computer Science from the University of São Paulo (2015). I am also member of Grupy of São Carlos (Grupy-Sanca). My research interests include Recommender Systems, Data Science, Web Development and Customization and adaptation of content.", "status": "Confirmada", "avatar": "https://secure.gravatar.com/avatar/85074fea74776f6f7dbc40b97fbe6311?s=500", "rating": "", "created_at": "", "notes": "- Duração: 4 ~6 horas\n- Nível de conhecimento: Intermediário\n- Configuração de ambiente e OS: [Linux, Windows e MAC] [Python 3]", "additional_info": "convidada/convidado", "description": "Que tal falar sobre recomendação?\n\nOs sistemas de recomendação são uma subárea de recuperação de informação (do inglês, Information Retrival) que tem por objetivo fazer novas sugestões personalizadas que possam vir a ser de interesse do usuário, com base nos seus feedback (sejam implícitos ou explícitos) ou nas escolhas feitas por outros usuários com gostos similares. Bons sistemas de recomendação podem aumentar as vendas/acessos em vários pontos percentuais. É por isso que eles se tornaram um recurso essencial para lojas e serviços online e têm sido uma área bastante procurada no mercado. Devido a esta necessidade de conquista, a personalização tem se apresentado como um fator facilitador no momento de \"cativar\" o usuário.\n\nAo navegar por sites como Amazon, Facebook e Americanas você já se deparou com frases como “Quem viu este produto, viu também…”, “Clientes que compraram este item também compraram…” e “Porque você comprou este produto…” ? Ou quem sabe, ao assistir um filme ou ouvir uma música no Netflix/Spotify, encontrou, dentre as sugestões, alguma outra produção que se encaixava direitinho com seu gosto? Este tutorial dará uma visão geral sobre os sistemas de recomendação utilizados nas tarefas de personalização, assim como ferramentas e bibliotecas que podem auxiliar os desenvolvedores a implementar esses sistemas em Python. Serão apresentadas diversas bases de dados públicas reais, scripts e algoritmos em Python, para gerar e avaliar a recomendação, além dos principais problemas que surgem durante a implementação de um recomendador. A fim de facilitar a aprendizagem e a compreensão do conceito, este tutorial irá se utilizar do framework Case Recommender: uma ferramenta implementada em Python, que possui uma série de populares algoritmos de recomendação, tanto para feedback implícito quanto explícito, em diferentes abordagens baseadas nos principais tipos de recomendação, sendo eles previsão de notas e ranking.\n\nSerão abordados, ainda, conceitos de Aprendizado de Máquina e Inteligência Artificial, como Cross Validation, KNN, SVD, métricas de similaridade, entre outros, utilizando as bibliotecas numpy, scipy e sklearn do Python. Assim, serão apresentados os principais conceitos e estratégias que os sistemas de recomendação utilizam para transformar dados em informação personalizada altamente poderosa. ", "url": "https://arthurfortes.github.io/", "name": "Arthur Fortes da Costa", "audience_level": "Intermediate"}, {"state": "", "confirmed": "", "email": "kotres@elipse.com.br ", "organization": "", "title": "Construindo uma plataforma para execução de algoritmos de Data Science", "abstract": "Vamos falar sobre a experiência de criação de uma plataforma para implantação de algoritmos Python em ambientes industriais. Quais as necessidades percebidas, as soluções adotadas e o desafio de levar Data Science do laboratório para a indústria.", "location": "", "shirt_size": "", "twitter": "", "tags": "", "talk_format": "", "bio": "Analista na Elipse Software, com mais de 12 anos de experiência em desenvolvimento de software.", "status": "Confirmada", "avatar": "../../assets/img/avatar/lucas_kotres.jpg", "rating": "", "created_at": "", "notes": "", "additional_info": "", "description": "Vamos falar sobre a experiência de criação de uma plataforma para implantação de algoritmos Python em ambientes industriais. Quais as necessidades percebidas, as soluções adotadas e o desafio de levar Data Science do laboratório para a indústria.", "url": "", "name": "Lucas Kotres", "audience_level": "all"}]}